# Q-9. 
Given the score of students in multiple exams

Test the hypothesis that the mean scores of all the students are the same. If not, name the
student with the highest score.

In [1]:
d={
    'Name':['Karan','Deepa','Karthik','Chandan','Jeevan'],
    'Exam 1':[85,70,90,75,95],
    'Exam 2':[90,80,85,70,92],
    'Final Exam':[92,85,88,75,86]
}

In [2]:
d

{'Name': ['Karan', 'Deepa', 'Karthik', 'Chandan', 'Jeevan'],
 'Exam 1': [85, 70, 90, 75, 95],
 'Exam 2': [90, 80, 85, 70, 92],
 'Final Exam': [92, 85, 88, 75, 86]}

In [3]:
import pandas as pd
import seaborn as sns

In [4]:
df3=pd.DataFrame(d)

In [5]:
df3.head()

      Name  Exam 1  Exam 2  Final Exam
0    Karan      85      90          92
1    Deepa      70      80          85
2  Karthik      90      85          88
3  Chandan      75      70          75
4   Jeevan      95      92          86

In [6]:
max=0
mea=[]
name=''
for i in range(len(df3)):
    su=0
    su=df3['Exam 1'][i]+df3['Exam 2'][i]+df3['Final Exam'][i]
    if su>max:
        max=su
        name=df3['Name'][i]
    me=su/3
    mea.append(me)
    
if mea.count(mea[0])==len(mea):
    print('We fail reject the null hypothesis as the Mean of all students is same')
else:
    print('We reject the null hypothesis as the Mean of all students is not same')
    print(f'{name} got highest score among all the students and highest score is {max}')

We reject the null hypothesis as the Mean of all students is not same
Jeevan got highest score among all the students and highest score is 273